In [172]:
import numpy as np
import pandas as pd

import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

# Import Dataset

In [201]:
xls_path = pd.ExcelFile('/Users/dileepsathyan/Documents/GitHub/Assignments/Vroom Virtusa/Analytics_Dataset.xlsx')
df_car_sales   = pd.read_excel(xls_path, 'car_sales')
df_car_details = pd.read_excel(xls_path, 'car_details')
df_car_claims  = pd.read_excel(xls_path, 'car_claims')

In [177]:
df_car_sales.head()

,car_id_sales,country,merchant_id,selling_date,selling_week,payment_date,sell_price,transport_to_merchant,transport_date
0,3421775349,ES,NaN,2021-04-29,2021-17,2021-05-14,1098,1,2021-05-31
1,5316743932,DE,NaN,2021-08-06,2021-31,2021-08-17,435,1,2021-08-31
2,5785159431,FR,NaN,2021-06-03,2021-22,2021-06-08,11028,0,NaN
3,7008763171,DE,NaN,2021-06-07,2021-23,2021-06-08,21100,1,NaN
4,1417558732,DE,NaN,2021-08-31,2021-35,2021-09-02,1943,1,2021-09-09

In [178]:
df_car_details.head()

,car_id_details,has_tuning,has_airbags,has_alarm_system,fuel_type,gear_type,ac_type,xenon_light,navigation_system,radio_system
0,5096178328,1,1,0,1039,1141,1049,0,1100,3534.0
1,1879501444,0,1,1,1039,1138,1049,0,0,3534.0
2,8375508078,1,1,1,1039,1139,0,0,0,1606.0
3,1266330246,0,1,0,1040,1139,1050,0,0,3534.0
4,9079520882,0,0,0,1039,1141,0,0,1100,3534.0

In [179]:
df_car_claims.head()

,car_id_claims,claim_number,full_refunds,partial_refunds,voucher_amount,claim_status
0,7525691980,NaN,0,0,NaN,NaN
1,8543168465,C1AG79687,0,1,620.140528,CLOSED_FULLY_PROCESSED
2,7308726237,NaN,0,0,NaN,NaN
3,9070724843,NaN,0,0,NaN,NaN
4,6274074693,NaN,0,0,NaN,NaN

# Data Cleaning

## 1. Car_Sales Dataframe Cleaning

In [203]:
df_car_sales.shape

(70512, 9)

In [204]:
df_car_sales.drop_duplicates(inplace=True)
df_car_sales.shape

(69618, 9)

#### Convert to right datatypes

In [205]:
# df_car_sales['car_id_sales'] = df_car_sales['car_id_sales'].astype('str')
# df_car_sales['merchant_id'] = df_car_sales['merchant_id'].astype('str')

df_car_sales['selling_date'] = pd.to_datetime(df_car_sales['selling_date'])
df_car_sales['payment_date'] = pd.to_datetime(df_car_sales['payment_date'])
df_car_sales['transport_date'] = pd.to_datetime(df_car_sales['transport_date'])

# Rename primary column
df_car_sales.rename(columns={'car_id_sales': 'car_id'}, inplace=True)

# Reset index
df_car_sales.reset_index(drop=True, inplace=True)

df_car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 69618 entries, 0 to 69617
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   car_id                 69618 non-null  int64
 1   country                69618 non-null  object
 2   merchant_id            19088 non-null  float64
 3   selling_date           69618 non-null  datetime64[ns]
 4   selling_week           69618 non-null  object
 5   payment_date           69618 non-null  datetime64[ns]
 6   sell_price             69618 non-null  int64
 7   transport_to_merchant  69618 non-null  int64
 8   transport_date         32689 non-null  datetime64[ns]
dtypes: datetime64[ns](3), float64(1), int64(3), object(2)
memory usage: 4.8+ MB

In [206]:
# Notice that the same car_ids are repeated for different merchant_ids

df_car_sales[df_car_sales['car_id'] == 5805619905]

,car_id,country,merchant_id,selling_date,selling_week,payment_date,sell_price,transport_to_merchant,transport_date
24276,5805619905,BE,16191229.0,2021-07-31,2021-30,2021-08-03,22596,1,2021-08-04
46323,5805619905,BE,14307587.0,2021-07-31,2021-30,2021-08-03,22596,1,2021-08-04

In [207]:
# There are merchant_ids who bought so many cars.

df_car_sales.merchant_id.value_counts()

8819318.0     823
5482442.0      97
2593085.0      92
6717821.0      64
2491964.0      62
             ...
3451474.0       1
6902952.0       1
5854417.0       1
6903110.0       1
10485917.0      1
Name: merchant_id, Length: 9102, dtype: int64

In [208]:
#### As long as we have no clarity on the correct Merchant who bought a car, it doesnt matter which record we delete.
#### Lets keep car_id only once and delete all following records for the sale.

df_car_sales = df_car_sales.drop_duplicates(subset='car_id', keep="first")
df_car_sales.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 69551 entries, 0 to 69617
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   car_id                 69551 non-null  int64
 1   country                69551 non-null  object
 2   merchant_id            19021 non-null  float64
 3   selling_date           69551 non-null  datetime64[ns]
 4   selling_week           69551 non-null  object
 5   payment_date           69551 non-null  datetime64[ns]
 6   sell_price             69551 non-null  int64
 7   transport_to_merchant  69551 non-null  int64
 8   transport_date         32654 non-null  datetime64[ns]
dtypes: datetime64[ns](3), float64(1), int64(3), object(2)
memory usage: 5.3+ MB

In [219]:
df_car_sales.head()

,car_id,country,merchant_id,selling_date,selling_week,payment_date,sell_price,transport_to_merchant,transport_date
0,3421775349,ES,NaN,2021-04-29,2021-17,2021-05-14,1098,1,2021-05-31
1,5316743932,DE,NaN,2021-08-06,2021-31,2021-08-17,435,1,2021-08-31
2,5785159431,FR,NaN,2021-06-03,2021-22,2021-06-08,11028,0,NaT
3,7008763171,DE,NaN,2021-06-07,2021-23,2021-06-08,21100,1,NaT
4,1417558732,DE,NaN,2021-08-31,2021-35,2021-09-02,1943,1,2021-09-09

## Car_Details Dataframe Cleaning

In [149]:
df_car_details.shape

(70512, 10)

In [150]:
df_car_details.drop_duplicates(inplace=True)
df_car_details.shape

(70034, 10)

In [151]:
df_car_details.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 70034 entries, 0 to 70511
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   car_id_details     70034 non-null  int64
 1   has_tuning         70034 non-null  int64
 2   has_airbags        70034 non-null  int64
 3   has_alarm_system   70034 non-null  int64
 4   fuel_type          70034 non-null  int64
 5   gear_type          70034 non-null  int64
 6   ac_type            70034 non-null  int64
 7   xenon_light        70034 non-null  int64
 8   navigation_system  70034 non-null  int64
 9   radio_system       43494 non-null  float64
dtypes: float64(1), int64(9)
memory usage: 5.9 MB

#### Convert to right datatypes

In [152]:
df_car_details['car_id_details'] = df_car_details['car_id_details'].astype('str')

# Rename primary column
df_car_details.rename(columns={'car_id_details': 'car_id'}, inplace=True)

# Reset index
df_car_details.reset_index(drop=True, inplace=True)

df_car_details.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70034 entries, 0 to 70033
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   car_id             70034 non-null  object
 1   has_tuning         70034 non-null  int64
 2   has_airbags        70034 non-null  int64
 3   has_alarm_system   70034 non-null  int64
 4   fuel_type          70034 non-null  int64
 5   gear_type          70034 non-null  int64
 6   ac_type            70034 non-null  int64
 7   xenon_light        70034 non-null  int64
 8   navigation_system  70034 non-null  int64
 9   radio_system       43494 non-null  float64
dtypes: float64(1), int64(8), object(1)
memory usage: 5.3+ MB

In [153]:
df_car_details.head()

,car_id,has_tuning,has_airbags,has_alarm_system,fuel_type,gear_type,ac_type,xenon_light,navigation_system,radio_system
0,5096178328,1,1,0,1039,1141,1049,0,1100,3534.0
1,1879501444,0,1,1,1039,1138,1049,0,0,3534.0
2,8375508078,1,1,1,1039,1139,0,0,0,1606.0
3,1266330246,0,1,0,1040,1139,1050,0,0,3534.0
4,9079520882,0,0,0,1039,1141,0,0,1100,3534.0

## Car_Claims Dataframe Cleaning

In [154]:
df_car_claims.shape

(70512, 6)

In [155]:
df_car_claims.drop_duplicates(inplace=True)
df_car_claims.shape

(70504, 6)

In [156]:
df_car_claims.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 70504 entries, 0 to 70511
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   car_id_claims    70504 non-null  int64
 1   claim_number     19974 non-null  object
 2   full_refunds     70504 non-null  int64
 3   partial_refunds  70504 non-null  int64
 4   voucher_amount   15173 non-null  float64
 5   claim_status     19974 non-null  object
dtypes: float64(1), int64(3), object(2)
memory usage: 3.8+ MB

#### Convert to right datatypes

In [157]:
df_car_claims['car_id_claims'] = df_car_claims['car_id_claims'].astype('str')
df_car_claims['claim_number'] = df_car_claims['claim_number'].astype('str')

# Rename primary column
df_car_claims.rename(columns={'car_id_claims': 'car_id'}, inplace=True)

# Reset index
df_car_claims.reset_index(drop=True, inplace=True)

df_car_claims.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70504 entries, 0 to 70503
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   car_id           70504 non-null  object
 1   claim_number     70504 non-null  object
 2   full_refunds     70504 non-null  int64
 3   partial_refunds  70504 non-null  int64
 4   voucher_amount   15173 non-null  float64
 5   claim_status     19974 non-null  object
dtypes: float64(1), int64(2), object(3)
memory usage: 3.2+ MB

In [158]:
df_car_claims.head()

,car_id,claim_number,full_refunds,partial_refunds,voucher_amount,claim_status
0,7525691980,nan,0,0,NaN,NaN
1,8543168465,C1AG79687,0,1,620.140528,CLOSED_FULLY_PROCESSED
2,7308726237,nan,0,0,NaN,NaN
3,9070724843,nan,0,0,NaN,NaN
4,6274074693,nan,0,0,NaN,NaN

# Combine the dataframes to 1

In [159]:
df_car_sales.shape

(69618, 9)

In [160]:
df_car_details.shape

(70034, 10)

In [161]:
df_car_claims.shape

(70504, 6)

In [167]:
df_merged = pd.merge(df_car_claims, df_car_details, how='left', on='car_id')
# df_merged = pd.merge(df_merged, df_car_sales, how='inner', on='car_id')
df_merged.head()

,car_id,claim_number,full_refunds,partial_refunds,voucher_amount,claim_status,has_tuning,has_airbags,has_alarm_system,fuel_type,gear_type,ac_type,xenon_light,navigation_system,radio_system
0,7525691980,nan,0,0,NaN,NaN,1,1,0,0,1139,1050,0,0,NaN
1,8543168465,C1AG79687,0,1,620.140528,CLOSED_FULLY_PROCESSED,0,0,0,0,1141,0,0,1100,3534.0
2,7308726237,nan,0,0,NaN,NaN,0,1,0,1040,1138,1050,0,0,NaN
3,9070724843,nan,0,0,NaN,NaN,0,1,0,1040,1138,1050,1089,0,3534.0
4,6274074693,nan,0,0,NaN,NaN,0,1,0,1040,1141,1050,0,1100,3534.0

In [168]:
df_merged.shape

(71512, 15)

In [169]:
df_car_sales.car_id.value_counts()

# merchant_id is different which causes duplicate entries

7623794326    2
5402284800    2
7096519625    2
4063580476    2
7613645214    2
             ..
2805485321    1
9403741772    1
3636330388    1
9376021039    1
5517395488    1
Name: car_id, Length: 69551, dtype: int64

In [170]:
df_car_details.car_id.value_counts()

# fuel_type and navigation_system are causing duplicate entries

9907511030    3
1550589125    3
4204449840    3
7613645214    3
8978100755    3
             ..
9764384875    1
4740781080    1
7310242299    1
3269394355    1
5517395488    1
Name: car_id, Length: 69551, dtype: int64

In [171]:
df_car_claims.car_id.value_counts()

# fuel_type and navigation_system are causing duplicate entries

1469750417    4
5149303881    4
7453031564    3
6267771382    3
5741286159    3
             ..
2168498850    1
9157300274    1
6694478254    1
7565842323    1
5517395488    1
Name: car_id, Length: 69551, dtype: int64